#折线图

from cutecharts.charts import Line

def line_base()->Line:
    chart=Line("每个月商品消费情况的折线图")
    chart.set_options(labels=['一','二','三','四','五','六','七','八','九','十','十一','十二'],x_label='时间（月）',y_label='商品金额（元）',legend_pos='upRight')
    chart.add_series('食品',[1500,2000,3000,2500,2000,1200,2600,3100,4800,2100,4500,3300])
    chart.add_series('衣服',[2000,1000,3200,2340,2540,1210,1200,1100,1800,2100,2500,3100])
    chart.add_series('电器',[3000,2500,2900,2503,2300,1270,2690,2100,2400,2190,2500,2900])
    chart.add_series('书籍',[500,200,300,250,200,120,260,310,480,210,450,330])
    chart.add_series('化妆品',[1000,2020,3030,2520,2020,1220,2620,3120,4820,2120,4520,3120])
    return chart

line_base().render("图表/一年的消费情况折线图.html")


